-- 1. Добавляем книги в таблицу [Books]
INSERT INTO [dbo].[Books] ([Title], [Author], [Genre], [PublishYear], [IsAvailable]) VALUES 
(N'Мастер и Маргарита', N'Михаил Булгаков', N'Классика', 1967, 1),
(N'1984', N'Джордж Оруэлл', N'Антиутопия', 1949, 1),
(N'Преступление и наказание', N'Фёдор Достоевский', N'Классика', 1866, 0), -- Эта книга как будто выдана
(N'Дюна', N'Фрэнк Герберт', N'Фантастика', 1965, 1);
GO

-- 2. Добавляем записи в таблицу [IssuedBook]
INSERT INTO [dbo].[IssuedBook] ([BookId], [ReaderName], [IssueDate], [ReturnDate]) VALUES 
(3, N'Иванов Иван Иванович', '2026-05-10', NULL), -- Книга еще не возвращена (должник)
(1, N'Петров Петр Петрович', '2026-05-01', '2026-05-15'); -- Книгу уже вернули
GO